MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/demo_app.c
/*
 * demo_app.c
 *
 *  Created on: Jun 25, 2024
 *      Author: Jan Mareš
 */


/* Includes ------------------------------------------------------------------*/
#include "usbpd_core.h"
#include "usbpd_dpm_core.h"
#include "usbpd_dpm_conf.h"
#include "usbpd_dpm_user.h"
#include "usbpd_devices_conf.h"
#include "usbpd_user_services.h"
#include "usbpd_pwr_if.h"
#include "demo_app.h"
#include "string.h"
#include "stdio.h"
#include "cmsis_os.h"
#include "max7219.h"
#if defined(_GUI_INTERFACE)
#include "gui_api.h"
#include "app.h"


#include "usbpd_def.h"
#include "stdbool.h"
#include <stm32g0xx_ll_adc.h>
#include "usb_device.h"
#include "usbd_cdc_if.h"
#include <usbpd_trace.h>

#endif /* _GUI_INTERFACE */


/*
 * Define
 */
//Initialize button event struct
SystemEvents systemEvents = {0};
ButtonManager buttonManager = {0};

//Init stateMachine struct
StateMachine stateMachine = {
		.currentState = STATE_INIT,
		.encoder = {
				.selDigit = 2,
				.increment = 10    // Default increment
			}
};
USBPD_DPM_SNKPowerRequestDetailsTypeDef powerRequestDetails;

SINKData_HandleTypeDef SNK_data = {
	.voltageMin = 500,
	.voltageSet = 330, //initial value to display
	.currentSet = 1000, //initial value to display
	.currentMin = 0,
	.currentOCPSet = 1000,
	.selMethod = PDO_SEL_METHOD_MAX_CUR,
	.encoder = {
		.selDigit = 2,
		.increment = 10    // Default increment
	}
};

// Define the pointer to the struct
SINKData_HandleTypeDef *dhandle = &SNK_data;

uint32_t srcPdoIndex; //variable that holds Pdo index from FindVoltageIndex
//USBPD_DPM_SNKPowerRequestDetailsTypeDef powerRequestDetails;
USBPD_StatusTypeDef powerProfiles;

void demo_app_loop(void) {
// Process button events
	processSystemEvents(&stateMachine, &systemEvents);

	// Run the state machine
	runStateMachine(&stateMachine, &SNK_data);

	// Reset button states after processing
	stateMachine.outputBtnPressed = false;
	stateMachine.lockBtnPressed = false;
	stateMachine.voltageCurrentBtnPressed = false;
	stateMachine.rotaryBtnPressed = false;
	stateMachine.encoderTurnedFlag = false;

}


/*
 * Define Functions
 */
void runStateMachine(StateMachine *sm, SINKData_HandleTypeDef *dhandle) {
    // Process events and transitions
    switch (sm->currentState) {
        case STATE_OFF:
            //handleOffState(sm, dhandle);
            break;
        case STATE_INIT:
            handleInitState(sm, dhandle);
            break;
        case STATE_IDLE:
            handleIdleState(sm, dhandle);
            break;
        case STATE_ACTIVE:
            handleActiveState(sm, dhandle);
            break;
        case STATE_LOCK:
            //handleLockState(sm, dhandle);
            break;
        case STATE_ERROR:
            //handleErrorState(sm, dhandle);
            break;
        case STATE_OCP_TOGGLE:
            //handleOCPToggleState(sm, dhandle);
            break;
        case STATE_SET_VALUES:
            handleSetValuesState(sm, dhandle);
            break;
        default:
            // Error handling
            sm->currentState = STATE_ERROR;
            //sm->errorCode = ERROR_INVALID_STATE;
            break;
    }


    // Check for timeouts in temporary states
/*
    if (sm->currentState == STATE_SET_VALUES) {

    	// Return to previous state
        if (systemEvents.stateTimeoutEvent) {
        	//Erase flag
        	systemEvents.stateTimeoutEvent = false;
        	// REQUEST PDO baset on set values (on SET_VALUES timed out event)
			if (sm->currentState == STATE_SET_VALUES) {
				int indexSRCAPDO = USER_SERV_FindSRCIndex(0, &powerRequestDetails, dhandle->voltageSet*10, dhandle->currentSet, dhandle ->selMethod);
				//Print to debug

				char _str[80];
				sprintf(_str,"APDO request: indexSRCPDO= %lu, VBUS= %lu mV, Ibus= %d mA", indexSRCAPDO, 10*dhandle->voltageSet, dhandle->currentSet);
				USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
				USBPD_DPM_RequestSRCPDO(0, indexSRCAPDO, dhandle->voltageSet*10, dhandle->currentSet);
			}
            // Return to previous state
            if (sm->lastState == STATE_IDLE) {
                sm->currentState = STATE_IDLE;
            } else if (sm->lastState == STATE_ACTIVE) {
                sm->currentState = STATE_ACTIVE;
            }
        }
    }*/
}

/*
 * Define Callbacks and ISR
 */
//BTN ISR to set event flags
void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin) {
	uint32_t currentTime = HAL_GetTick();

    if (GPIO_Pin == SW1_TOGGLE_I_V_Pin) {
        systemEvents.voltageCurrentBtnEvent = true;
        EXTI->IMR1 &= ~(EXTI_IMR1_IM2);
    } else if (GPIO_Pin == SW2_DEBUG_BTN_Pin) {
        buttonManager.buttonPressTimes[BTN_LOCK] = currentTime;
        buttonManager.buttonStates[BTN_LOCK] = true;
        EXTI->IMR1 &= ~(EXTI_IMR1_IM4);


        int indexSRCAPDO = USER_SERV_FindSRCIndex(0, &powerRequestDetails, dhandle->voltageSet*10, dhandle->currentSet, dhandle ->selMethod);
		//Print to debug
		char _str[80];
		sprintf(_str,"APDO request: indexSRCPDO= %lu, VBUS= %lu mV, Ibus= %d mA", indexSRCAPDO, 10*dhandle->voltageSet, dhandle->currentSet);
		USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));


		USBPD_StatusTypeDef status = USBPD_DPM_RequestSRCPDO(0, indexSRCAPDO, dhandle->voltageSet*10, dhandle->currentSet);

		if (status != USBPD_OK) {
		    char failureMsg[100];
		    snprintf(failureMsg, sizeof(failureMsg),
		             "PDO Request Failed. Status: %d", status);
		    USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)failureMsg, strlen(failureMsg));
		}

    } else if (GPIO_Pin == SW3_OFF_ON_Pin) {
        systemEvents.outputBtnEvent = true;
        EXTI->IMR1 &= ~(EXTI_IMR1_IM1);
    } else if (GPIO_Pin == ENC_TOGGLE_UNITS_Pin) {
        systemEvents.rotaryBtnEvent = true;
        EXTI->IMR1 &= ~(EXTI_IMR1_IM8);
    }

    // Start debounce timer
    buttonManager.debounceActive = true;
    TIM7->ARR = 200;
    LL_TIM_SetCounter(TIM7, 0);
    LL_TIM_EnableCounter(TIM7);
}

void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin) {
	if (GPIO_Pin == SW2_DEBUG_BTN_Pin && buttonManager.buttonStates[BTN_LOCK]) {
		buttonManager.pressDuration = buttonManager.currentTime - buttonManager.buttonPressTimes[BTN_LOCK];
		buttonManager.buttonStates[BTN_LOCK] = false;

