MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/demo_app.c
		if (buttonManager.pressDuration >= LONG_PRESS_THRESHOLD) {
			systemEvents.lockBtnLongEvent = true;
		} else {
			systemEvents.lockBtnEvent = true;
		}
	}
}

//TIM capture callback
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim) {
    if (htim->Instance == TIM3) {
    	systemEvents.encoderTurnEvent = true;
    }
}

// Timer interrupt handler for button debounce
void TIM7_ISR(void) {
    if (LL_TIM_IsActiveFlag_UPDATE(TIM7)) {
        LL_TIM_ClearFlag_UPDATE(TIM7);
        LL_TIM_DisableCounter(TIM7);
        buttonManager.debounceActive = false;

        // Re-enable button interrupts after debounce period
        if (buttonManager.buttonStates[BTN_VOLTAGE_CURRENT]) {
            EXTI->IMR1 |= EXTI_IMR1_IM2;
        }
        if (buttonManager.buttonStates[BTN_LOCK]) {
            EXTI->IMR1 |= EXTI_IMR1_IM4;
        }
        if (buttonManager.buttonStates[BTN_OUTPUT]) {
            EXTI->IMR1 |= EXTI_IMR1_IM1;
        }
        if (buttonManager.buttonStates[BTN_ROTARY]) {
            EXTI->IMR1 |= EXTI_IMR1_IM8;
        }
    }
}

void TIM14_ISR(void) {
	if (LL_TIM_IsActiveFlag_UPDATE(TIM14)) {
		// Clear the update interrupt flag
		LL_TIM_ClearFlag_UPDATE(TIM14);

		if (stateMachine.currentState == STATE_ACTIVE || stateMachine.currentState == STATE_SET_VALUES) {
			// Handle periodic check for ACTIVE state
			systemEvents.periodicCheckEvent = true;
			//Reset CNT value
			LL_TIM_SetCounter(TIM14, 0);

			//Start timer again
			LL_TIM_EnableCounter(TIM14);
		}
	}
}


void TIM15_ISR(void) {
	if (LL_TIM_IsActiveFlag_UPDATE(TIM15)) {
		// Clear the update interrupt flag
		LL_TIM_ClearFlag_UPDATE(TIM15);

		// Handle periodic check for ACTIVE state
		systemEvents.stateTimeoutEvent = true;
		//Reset CNT value
		LL_TIM_DisableCounter(TIM15);  // Stop the timer after timeout

		if (stateMachine.currentState == STATE_SET_VALUES) {
		}

	}
}

// Process button events in the main loop (Convert hardware events into logical events)
void processButtonEvents(StateMachine *sm, SystemEvents *events) {
    if (events->outputBtnEvent) {
    	//Reset btn event flag
        events->outputBtnEvent = false;
        sm->outputBtnPressed = true;
    } else if (events->voltageCurrentBtnEvent) {
    	events->voltageCurrentBtnEvent = false;
    	sm->voltageCurrentBtnPressed = true;
    } else if (events->lockBtnEvent) {
    	events->lockBtnEvent = false;
		sm->lockBtnPressed = true;
    } else if (events->rotaryBtnEvent) {
    	//Reset btn event flag
    	events->rotaryBtnEvent = false;
		sm->rotaryBtnPressed = true;

    }
}

// Main system event processor that calls specialized handlers
void processSystemEvents(StateMachine *sm, SystemEvents *events) {
    // Process different event types using specialized functions
    processButtonEvents(sm, events);

    if (events->encoderTurnEvent) {
    	sm->encoderTurnedFlag = true;
    	events->encoderTurnEvent = false;
    }
    // Process AWDG events
    if (events->awdgEvent) {
        //events->awdgEvent = false;
        //sm->awdgTriggered = true;
    }

    // Process timer events
    /*
    if (events->timer1Event) {
        events->timer1Event = false;
        // Handle timer1 event
    }*/

}

/*
 * Define state Handle functions
 */

void handleIdleState(StateMachine *sm, SINKData_HandleTypeDef *dhandle) {
    // Entry actions (if just entered this state)
    static bool entryDone = false;

    //=======================================================
	// ENTRY ACTIONS - Executed once when entering the state
	//=======================================================
    if (!entryDone) {
        // Display set values
        max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
        max7219_PrintIspecial(SEGMENT_1, dhandle->voltageSet, 3);

        // Ensure output is off
        HAL_GPIO_WritePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin, GPIO_PIN_RESET);

        // Check temperature and control fan (not shown in your code)

        // Save state for return from temporary states
        strcpy(sm->lastStateStr, "IDLE");
        sm->lastState = STATE_IDLE;

        entryDone = true;
    }

    //=================================================
	// TRANSITION CHECKS - Check for state transitions
	//=================================================

    // Process events and transitions
    if (sm->outputBtnPressed) {
        sm->currentState = STATE_ACTIVE;
        entryDone = false;
    } else if (sm->lockBtnHoldActive) {
        sm->currentState = STATE_LOCK;
        entryDone = false;
    } else if (sm->ocpBtnPressed) {
        sm->currentState = STATE_OCP_TOGGLE;
        sm->stateEntryTime = HAL_GetTick();
        sm->timeoutCounter = 500;  // 0.5 seconds timeout
        entryDone = false;
    } else if (sm->rotaryBtnPressed) {
        sm->currentState = STATE_SET_VALUES;
        sm->timeoutCounter = 4000;  // 4 seconds timeout
        sm->rotaryBtnPressed = false;
        entryDone = false;
    }
}

void handleActiveState(StateMachine *sm, SINKData_HandleTypeDef *dhandle) {
	//Declare static variables
	// Set check interval Make the timer persistent across function calls
	static uint32_t lastCheckTime = 0; // declared to 0 only once, then retains value
    static bool entryDone = false;
	const uint32_t CHECK_INTERVAL_MS = 500; // Check every 500ms

	//=======================================================
	// ENTRY ACTIONS - Executed once when entering the state
	//=======================================================

    if (!entryDone) {
        // Ensure output is off
        HAL_GPIO_WritePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin, GPIO_PIN_SET);

        // Save state for return from temporary states
        strcpy(sm->lastStateStr, "ACTIVE");
        sm->lastState = STATE_ACTIVE;

        // Initialize the check timer
        TIM14->ARR = 500;
		LL_TIM_SetCounter(TIM14, 0); //set counter register value of timer 7 to 0
		LL_TIM_EnableIT_UPDATE(TIM14); // Enable update interrupt
		LL_TIM_EnableCounter(TIM14);

        entryDone = true;
    }

